module.exports = {

    // Stat Sistemi Ayarları

    generalChatCategory: "999730485733371904",

    musicRooms: ["999730576217096222","999730578284871771"],

    chatCategorys: [
        {id: "999730641589514281", isim: "Genel Chat"},

        {id: "999730503483666544", isim: "Genel Log Kanalları"},
        {id: "999730503483666544", isim: "Güvenlik Log Kanalları"},
        {id: "999730689823998033", isim: "D/C Chat"},
        {id: "999730691375890432", isim: "V/K Chat"},
        {id: "999730735156056095", isim: "Streamer Chat"},
        {id: "999730679304691752", isim: "Sorun Çözme Chat"},
        {id: "999730686938329128", isim: "Oyun Chat"},
        {id: "999730686938329128", isim: "Board Chat"},
        {id: "999730600174944356", isim: "Yetkili Chat"},
        {id: "999730591643738215", isim: "Yönetim Chat"},
        {id: "999730525449232436", isim: "Kayıt Chat"}

    ],

    voiceCategorys: [
        {id: "999730496735019120", isim: "Özel Odalar"},
        {id: "999730496735019120", isim: "Alone Odalar"},
        {id: "999730492909826178", isim: "Public Odalar"},
        {id: "999730476396855326", isim: "Kayıt Odalar"},
        {id: "999730495564808343", isim: "Oyun Odalar"},
        {id: "999730483493613628", isim: "Yönetim Odalar"},
        {id: "999730489822826637", isim: "Sorun Çözme Odalar"},
        {id: "999730491534102558", isim: "Streamer Odalar"},
        {id: "999730500069499000", isim: "V/K Odalar"},
        {id: "999730520084713680", isim: "Yönetim Toplantı Odası"},
        {id: "999730522735517866", isim: "Toplantı Odası"},		
        {id: "999730498379198626", isim: "D/C Odalar"},
        {id: "999730573687926954", isim: "Sleep Room (AFK)"}
    ],

    // Upstaff Sistemi Ayarları

    system: true,
    endstaff: "999730325544501379",
    howMsVoicePoint: "600000",
    howMessagePoint: "1",
    accessPointChannels: ["999730485733371904","999730487889252442","999730489042681897","999730489822826637","999730498379198626","999730500069499000"],
    fullPointChannels: ["999730494310715432","999730496735019120","999730492909826178", "999730491534102558", "999730476396855326"],


    "points": {
        voice: 7.5,
        halfVoice: 2.5,
        invite: 20,
        message: 1,
        tagged: 50,
        staff: 70,
        record: 15,
        tasks: 5,
    },

    staffs: [
        { rol: "999730341734535239", exrol: ["999730351423365262"], No: "0"},
        { rol: "999730339939360820", exrol: ["999730351423365262"], No: "1", Puan: "700"},
        { rol: "999730337292759212", exrol: ["999730351423365262"], No: "2", Puan: "1000"},
        { rol: "999730336269357116", exrol: ["999730351423365262"], No: "3", Puan: "1300"},
        { rol: "999730335174631465", exrol: ["999730351423365262"], No: "4", Puan: "1600"},
        { rol: "999730334637768774", exrol: ["999730351423365262"], No: "5", Puan: "1900"},
        { rol: "999730333899559014", exrol: ["999730351423365262"], No: "6", Puan: "2200"},
        { rol: "999730333090070629", exrol: ["999730351423365262"], No: "7", Puan: "2600"},
        { rol: "999730330623819786", exrol: ["999730351423365262"], No: "8", Puan: "3000"},
        { rol: "999730329839480862", exrol: ["999730351423365262"], No: "9", Puan: "3400"},
        { rol: "999730327285141624", exrol: ["999730351423365262"], No: "10", Puan: "3800"},
        { rol: "999730328115630121", exrol: ["999730351423365262"], No: "11", Puan: "4200"},
        { rol: "999730326546960394", exrol: ["999730351423365262"], No: "12", Puan: "4700"},
        { rol: "999730325544501379", exrol: ["999730351423365262"], No: "13", Puan: "5200"},

        // Yönetim
        /*
        { rol: "970367673747771402", exrol: ["999730351423365262"], No: "14", Puan: "4375"  },
        { rol: "970367672552394782", exrol: ["999730351423365262"], No: "15", Puan: "4375"  },
        { rol: "970367671348637736", exrol: ["999730351423365262"], No: "16", Puan: "4375" , Atlama: true },
        { rol: "970367667921903637", exrol: ["999730351423365262"], No: "17", Puan: "4375" , Atlama: true },
        { rol: "970367667150135327", exrol: ["999730351423365262"], No: "18", Puan: "4375" , Atlama: true },
        { rol: "970367665120116766", exrol: ["999730351423365262"], No: "19", Puan: "4375" , Atlama: true },
        { rol: "970367661097779230", exrol: [""], No: "20", Puan: "4375" , Atlama: true },
        { rol: "970367659780755466", exrol: [""], No: "21", Puan: "4375" , Atlama: true },

        */

    ]
}
